app/views/OWS/Membership/UpdateEnrollmentCode.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:mem="http://webservices.micros.com/ows/5.1/Membership.wsdl">
    <soapenv:Header>
      <core:OGHeader transactionID="{transactionID}" primaryLangID="E" timeStamp="{timeStamp}" xmlns="http://webservices.micros.com/og/4.3/Core/">
         <core:Origin entityID="{hotelCode}" systemType="WEB"/>
         <core:Destination entityID="{hotelCode}" systemType="PMS"/>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <mem:UpdateEnrollmentCodeRequest>
         <mem:MembershipId type="INTERNAL">{MembershipId}</mem:MembershipId>
         <mem:EnrollmentCode></mem:EnrollmentCode>
      </mem:UpdateEnrollmentCodeRequest>
   </soapenv:Body>
</soapenv:Envelope>